rhoPimpleFoam_yplus40_omega98_0/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  4;

method              hierarchical;

simpleCoeffs
{
    n =          (2 2 1);
  // delta       0.001;
}

hierarchicalCoeffs
{
    n               (2 2 1);
 //   delta           0.001;
    order           xyz;
}


// ************************************************************************* //
